#+TITLE: March 12, 2017 - March 28, 2017
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS                                        | WAITING | DONE                                                           | CANCELED |
|------+------+----------------------------------------------------+---------+----------------------------------------------------------------+----------|
|      |      | READING.1489241516. Linux Device Drivers, 3rd edit |         | KERNEL.1489241583. Try shakthimaan Linux device d (2017-03-13) |          |
|      |      | KERNEL.1489241685. Test suite for shakthimaan Lin  |         |                                                                |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME   | ESTIMATED | ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|--------+-----------+--------+------+-----------+--------------+------------|
| Mbuf   |         0 |      0 |    0 |         0 |   2017-03-17 | ---------- |
| Mpduty |      24.0 |   6.25 |  4.0 |      20.0 |   2017-03-31 | ##-------- |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
:                                                                               
:                                    Burndown                                   
:                                                                               
:  35 ++------+-------+--------+-------+-------+-------+--------+-------+--++   
:     |   ###                                                               |   
:     |   ...#                                               ACTUAL ####### |   
:  30 ++      ##################                              IDEAL .......++
:     |           ....                                                      |   
:  25 ++              .....                                                ++   
:     |                    ....                                             |   
:     |                        ....                                         |   
:  20 ++                           ....                                    ++   
:     |                                ....                                 |   
:  15 ++                                   ....                            ++   
:     |                                        ....                         |   
:     |                                            ....                     |   
:  10 ++                                               .....               ++   
:     |                                                     ....            |   
:   5 ++                                                        ....       ++   
:     |                                                             ....    |   
:     |                                                                 ....|   
:   0 ++------+-------+--------+-------+-------+-------+--------+-------+--+.   
:     0       2       4        6       8       10      12       14      16      
:                                                                               
:
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED   |
|-----+------------+--------+-------+-------------------|
|   1 | 2017-03-12 |   34.0 |    32 |                   |
|   2 | 2017-03-13 |   30.0 |    30 | KERNEL.1489241583 |
|   3 | 2017-03-14 |   30.0 |    28 |                   |
|   4 | 2017-03-15 |   30.0 |    26 |                   |
|   5 | 2017-03-16 |   30.0 |    24 |                   |
|   6 | 2017-03-17 |   30.0 |    22 |                   |
|   7 | 2017-03-18 |        |    20 |                   |
|   8 | 2017-03-19 |        |    18 |                   |
|   9 | 2017-03-20 |        |    16 |                   |
|  10 | 2017-03-21 |        |    14 |                   |
|  11 | 2017-03-22 |        |    12 |                   |
|  12 | 2017-03-23 |        |    10 |                   |
|  13 | 2017-03-24 |        |     8 |                   |
|  14 | 2017-03-25 |        |     6 |                   |
|  15 | 2017-03-26 |        |     4 |                   |
|  16 | 2017-03-27 |        |     2 |                   |
|  17 | 2017-03-28 |        |     0 |                   |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                                                                 | TASKID             | OWNER  | PRIORITY | TODO        | ESTIMATED | ACTUAL |
|----------------------------------------------------------------------+--------------------+--------+----------+-------------+-----------+--------|
| * TASKS                                                              |                    |        | B        |             |      34.0 |   6.25 |
|----------------------------------------------------------------------+--------------------+--------+----------+-------------+-----------+--------|
| ** READING                                                           |                    |        | B        |             |      12.0 |        |
| *** Linux Device Drivers, 3rd edition, Part II                       | READING.1489241516 | mpduty | B        | IN_PROGRESS |      12.0 |        |
|----------------------------------------------------------------------+--------------------+--------+----------+-------------+-----------+--------|
| ** WRITING                                                           |                    |        | B        |             |       5.5 |        |
| *** [Blog] Basic Parabola GNU/Linux-libre install steps              | HACKING.1486719087 | mbuf   | B        |             |       3.0 |        |
| *** [Blog] PLUG Clipart Hackathon                                    | WRITING.1489394843 | shaks  | B        |             |       2.5 |        |
|----------------------------------------------------------------------+--------------------+--------+----------+-------------+-----------+--------|
| ** HACKING                                                           |                    |        | B        |             |       4.0 |        |
| *** Org-mode task DONE should automatically update PROPERTIES ACTUAL | HACKING.1485136980 | mbuf   | B        |             |       4.0 |        |
|----------------------------------------------------------------------+--------------------+--------+----------+-------------+-----------+--------|
| ** KERNEL                                                            |                    |        | B        |             |      12.5 |   6.25 |
| *** Try shakthimaan Linux device driver code examples, Part II [7/7] | KERNEL.1489241583  | mpduty | B        | DONE        |       4.0 |   6.25 |
| *** Test suite for shakthimaan Linux device driver code examples     | KERNEL.1489241685  | mpduty | B        | IN_PROGRESS |       8.0 |        |
| *** [PR-1] Review and merge for Linux device driver code examples    | KERNEL.1489242032  | mbuf   | B        |             |       0.5 |        |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 17
  :SPRINTSTART: <2017-03-12 Sun>
  :wpd-mpduty:      2
  :wpd-mbuf:      1
  :END:
** READING
*** IN_PROGRESS Linux Device Drivers, 3rd edition, Part II
    :PROPERTIES:
    :ESTIMATED: 12.0
    :ACTUAL:
    :OWNER: mpduty
    :ID: READING.1489241516
    :TASKID: READING.1489241516
    :END:
    :LOGBOOK:
    CLOCK: [2017-03-17 Fri 08:15]--[2017-03-17 Fri 10:35] =>  2:20
    CLOCK: [2017-03-15 Wed 20:55]--[2017-03-15 Wed 22:10] =>  1:15
    :END:
    - [X] Chapter 6: Advanced Char Driver Operations
    - [ ] Chapter 7: Time, Delays, and Deferred Work 	
    - [ ] Chapter 8: Allocating Memory 	
    - [ ] Chapter 9: Communicating with Hardware 	
    - [ ] Chapter 10: Interrupt Handling 	
    - [ ] Chapter 11: Data Types in the Kernel 	
    - [ ] Chapter 12: PCI Drivers 	
    - [ ] Chapter 13: USB Drivers 	
    - [ ] Chapter 14: The Linux Device Model 	
    - [ ] Chapter 15: Memory Mapping and DMA 	
    - [ ] Chapter 16: Block Drivers 	
    - [ ] Chapter 17: Network Drivers 	
    - [ ] Chapter 18: TTY Drivers    
** WRITING
*** [Blog] Basic Parabola GNU/Linux-libre install steps
    :PROPERTIES:
    :ESTIMATED: 3.0
    :ACTUAL:
    :OWNER: mbuf
    :ID: HACKING.1486719087
    :TASKID: HACKING.1486719087
    :END:
*** [Blog] PLUG Clipart Hackathon
    :PROPERTIES:
    :ESTIMATED: 2.5
    :ACTUAL:
    :OWNER: shaks
    :ID: WRITING.1489394843
    :TASKID: WRITING.1489394843
    :END:
** HACKING
*** Org-mode task DONE should automatically update PROPERTIES ACTUAL
    :PROPERTIES:
    :ESTIMATED: 4.0
    :ACTUAL:
    :OWNER: mbuf
    :ID: HACKING.1485136980
    :TASKID: HACKING.1485136980
    :END:
** KERNEL
*** DONE Try shakthimaan Linux device driver code examples, Part II [7/7]
    CLOSED: [2017-03-13 Mon 22:54]
    :PROPERTIES:
    :ESTIMATED: 4.0
    :ACTUAL: 6.25
    :OWNER: mpduty
    :ID: KERNEL.1489241583
    :TASKID: KERNEL.1489241583
    :END:
    :LOGBOOK:
    CLOCK: [2017-03-12 Sun 10:15]--[2017-03-12 Sun 16:30] =>  6:15
    :END:
    - [X] Example 7
    - [X] Example 8
    - [X] Example 9
    - [X] Example 10
    - [X] Example 11
    - [X] Example 12
    - [X] Example 13
*** IN_PROGRESS Test suite for shakthimaan Linux device driver code examples
    :PROPERTIES:
    :ESTIMATED: 8.0
    :ACTUAL:
    :OWNER: mpduty
    :ID: KERNEL.1489241685
    :TASKID: KERNEL.1489241685
    :END:
    :LOGBOOK:
    CLOCK: [2017-03-13 Mon 10:15]--[2017-03-13 Mon 12:45] =>  2:30
    :END:
*** [PR-1] Review and merge for Linux device driver code examples
    :PROPERTIES:
    :ESTIMATED: 0.5
    :ACTUAL:
    :OWNER: mbuf
    :ID: KERNEL.1489242032
    :TASKID: KERNEL.1489242032
    :END:
    Source: https://github.com/shakthimaan/linux-device-driver-examples/pull/1
